<script>
	import * as Accordion from '$lib/components/ui/accordion';
</script>

<div class="mx-24 mt-16">
	<h1 class="scroll-m-20 text-center text-3xl tracking-tight lg:text-4xl">FAQ</h1>
	<Accordion.Root class="mt-8">
		<Accordion.Item value="item-1">
			<Accordion.Trigger>Как начать играть?</Accordion.Trigger>
			<Accordion.Content>
				Заполни форму на главной странице, мы добавим тебя в whitelist. После этого необходимо
				установить лаунчер (мы советуем Prism Launcher или Modrinth App) и скачать наш модпак.
				Запусти модпак и нажимай на кнопку "Оффициальный сервер". Все готово 🎉!
			</Accordion.Content>
		</Accordion.Item>
		<Accordion.Item value="item-2">
			<Accordion.Trigger>Где взять IP?</Accordion.Trigger>
			<Accordion.Content>
				IP сервера находится прямо у нас в модпаке. После установки модпака, запусти его и нажми на
				кнопку "Оффициальный сервер". Тебя автоматически подключит к серверу.
			</Accordion.Content>
		</Accordion.Item>
		<Accordion.Item value="item-3">
			<Accordion.Trigger>Какое минимальное количество памяти требуется?</Accordion.Trigger>
			<Accordion.Content>
				Модпаку требуется 4 ГБ оперативной памяти выделенной для Minecraft. Мы рекомендуем
				использовать 6 ГБ оперативной памяти.
			</Accordion.Content>
		</Accordion.Item>
		<Accordion.Item value="item-4">
			<Accordion.Trigger>Стоят ли моды на оптимизацию?</Accordion.Trigger>
			<Accordion.Content>
				Да, мы используем моды на оптимизацию, чтобы улучшить производительность игры. Модпак
				построен на базе Forge, поэтому мы используем Embeddium для оптимизации графики и
				FerriteCore для оптимизации памяти. Также стоит много других модов, которые улучшают
				производительность.
			</Accordion.Content>
		</Accordion.Item>
	</Accordion.Root>
</div>
